Revit 2026 API

# LightDistribution Properties

---

The LightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

LightDistribution Class

Autodesk.Revit.DB.Lighting Namespace